In [54]:
import pandas as pd
from pathlib import Path
pd.set_option('display.max_rows', None)

In [57]:
file_path = Path('budget_data.csv')
df = pd.read_csv(file_path)
df.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

In [59]:
total_months = df.shape[0]
print(f" Total months: {total_months}")

 Total months: 86

In [61]:
df['Shift'] = df['Profit/Losses'].shift()
df.head()

       Date  Profit/Losses     Shift
0  Jan-2010         867884       NaN
1  Feb-2010         984655  867884.0
2  Mar-2010         322013  984655.0
3  Apr-2010         -69417  322013.0
4  May-2010         310503  -69417.0

In [62]:
df['Change'] = df['Profit/Losses'] - df['Shift']
df.head()

       Date  Profit/Losses     Shift    Change
0  Jan-2010         867884       NaN       NaN
1  Feb-2010         984655  867884.0  116771.0
2  Mar-2010         322013  984655.0 -662642.0
3  Apr-2010         -69417  322013.0 -391430.0
4  May-2010         310503  -69417.0  379920.0

In [66]:
df['Change'].mean()

-2315.1176470588234

In [75]:
df['Profit/Losses'].sum()

38382578

In [78]:
df.set_index("Date", inplace=True)
df.head()

          Profit/Losses     Shift    Change
Date
Jan-2010         867884       NaN       NaN
Feb-2010         984655  867884.0  116771.0
Mar-2010         322013  984655.0 -662642.0
Apr-2010         -69417  322013.0 -391430.0
May-2010         310503  -69417.0  379920.0

In [81]:
df['Change'].idxmax()

'Feb-2012'

In [82]:
df['Change'].idxmin()

'Sep-2013'

In [76]:
df['Change'].max()

1926159.0

In [77]:
df['Change'].min()

-2196167.0